

function answerOne(){
  alert("答案 A 的你——无事生非型（猴子）。你的生活只有黑白对错，没有中间地带。无论在任何时候，总用最坏的角度看待事情，总是考虑最糟糕的情况。你不会享受从开始到结束都很愉快地做事情，总担心出错导致失败。即使顺利完成，也不会很高兴，因为你是完美主义者，总因为小瑕疵和偶尔的失误而心情不美丽。");
}

function answerTwo(){
  alert("答案 B 的你——阴晴不定型（蛇）。基本上你是一个情绪化的人，心情好坏只在一线之间，可以说没有任何标准来判断。在公司的时候，心情不好时，会忽略所有人，冷淡地对待别人，即使是老板的电话也会拒绝。所以每个人都怕看到你情绪化的行为，但这是不够成熟的表现。");
}

function answerThree(){
  alert("答案 C 的你——积极乐观型（小狗）。心情愉快的时候，别人说什么都可以，心情不好时也十分明显，但是你很单纯，不喜欢自己时刻沉浸在糟糕的情绪里，所以会努力想快乐的事情。这种类型的人会积极地去控制自己的情绪，积极地思考，但也无法避免有时会突然陷入情绪低潮。");
}

function answerFour(){
  alert("答案 D 的你——无忧无虑型（鸽子）。你是一个乐天派，因为你被很多人保护着，不会有很多困扰你的问题和是非，所以不容易受到外界影响，相对地，也有不好的一面，因为不会察言观色，很容易得罪人。做事情往往不会想到后果，所以，常让别人为你善后。");
}
